In [69]:
import pandas as pd
import numpy as np

In [70]:
#任务1将列表转化为Nunpy数组
import numpy as np
data0 = [2, 4, 6.5, 8]
arr0 = np.array(data0)

In [71]:
#pandas中的Series数据类型
s=pd.Series(data=[100,'a',{'dic1':5}],
            index=pd.Index(['id1',20,'third'],name='my_idx'),
            dtype='object',
            name='my_name')

In [72]:
s2=pd.Series([1,2,3,4])

In [73]:
s2.index.value_counts()

0    1
1    1
2    1
3    1
Name: count, dtype: int64

In [74]:
type(s2.values[0])

numpy.int64

In [75]:
s2.size

4

In [76]:
s2.shape

(4,)

In [77]:
#任务3：创建DataFrame类型的数据，并获取其索引、值及表大小
d={
    "one":pd.Series([1.0,2.0,3.0],index=["a","b","c"]),
    "two":pd.Series([1.0,2.0,3.0,4.0],index=["a","b","c","d",])}
df=pd.DataFrame(d)

In [78]:
d1={
    "作者":pd.Series(['余华','莫言','priest']),
    "作品":pd.Series(['活着','生死疲劳','杀破狼']),
    "价格":pd.Series(['23','45','108'])
    }
df2=pd.DataFrame(d1)

In [79]:
df2.index.values

array([0, 1, 2], dtype=int64)

In [80]:
df2.shape

(3, 3)

In [81]:
df2.size

9

In [82]:
贵州茅台原始数据=pd.read_csv(R'data\600519.csv')

In [83]:
贵州茅台原始数据

,day,STOCK_CODE,open,close,maximum,minimum,volume,TURNOVER
0,2001-08-27,6005191,34.51,35.55,37.78,32.85,406318,1410347008
1,2001-08-28,6005191,34.99,36.86,37.00,34.61,129647,463463008
2,2001-08-29,6005191,36.98,36.38,37.00,36.10,53252,194689000
3,2001-08-30,6005191,36.28,37.10,37.51,36.00,48013,177558000
4,2001-08-31,6005191,37.15,37.01,37.62,36.80,23231,86231000
...,...,...,...,...,...,...,...,...
4089,2018-10-29,6005191,549.09,549.09,549.09,549.09,49076,2694714080
4090,2018-10-30,6005191,510.00,524.00,543.00,509.02,204397,10663392512
4091,2018-10-31,6005191,527.00,548.90,555.00,522.00,96885,5239853056
4092,2018-11-01,6005191,555.00,563.00,585.50,551.25,98107,5581027328
4093,2018-11-02,6005191,585.00,599.90,600.00,572.24,89157,5227695104

In [84]:
#按列查询数据
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [85]:
贵州茅台原始数据[['TURNOVER','volume']]

         TURNOVER  volume
0      1410347008  406318
1       463463008  129647
2       194689000   53252
3       177558000   48013
4        86231000   23231
...           ...     ...
4089   2694714080   49076
4090  10663392512  204397
4091   5239853056   96885
4092   5581027328   98107
4093   5227695104   89157

[4094 rows x 2 columns]

In [86]:
#按照行索引
贵州茅台原始数据.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [87]:
贵州茅台=贵州茅台原始数据.set_index('day')

In [88]:
#loc索引器
#单个元素
贵州茅台.loc['2001-08-27']

STOCK_CODE    6.005191e+06
open          3.451000e+01
close         3.555000e+01
maximum       3.778000e+01
minimum       3.285000e+01
volume        4.063180e+05
TURNOVER      1.410347e+09
Name: 2001-08-27, dtype: float64

In [89]:
贵州茅台.loc['2001-08-27','close']

35.55

In [90]:
贵州茅台.loc['2001-08-27',['open','close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [91]:
贵州茅台.loc['2001-08-27':'2001-10-08','open']

day
2001-08-27    34.51
2001-08-28    34.99
2001-08-29    36.98
2001-08-30    36.28
2001-08-31    37.15
2001-09-03    37.20
2001-09-04    37.01
2001-09-05    37.61
2001-09-06    37.35
2001-09-07    36.50
2001-09-10    35.40
2001-09-11    36.80
2001-09-12    35.33
2001-09-13    36.01
2001-09-14    36.01
2001-09-17    36.08
2001-09-18    35.88
2001-09-19    36.30
2001-09-20    36.90
2001-09-21    36.28
2001-09-24    36.06
2001-09-25    36.28
2001-09-26    36.11
2001-09-27    36.08
2001-09-28    36.90
2001-10-08    37.00
Name: open, dtype: float64

In [92]:
c1=贵州茅台['open']<35
c2=贵州茅台['close']<35
布尔列表=c1&c2
贵州茅台.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [93]:
#使用函数作为索引
def condition(pd):
    c1=pd['open']<35
    c2=pd['close']<35
    布尔列表=c1&c2
    return 布尔列表

In [94]:
贵州茅台.loc[condition]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [97]:
贵州茅台.query('open<35 and close<35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [ ]:
贵州茅台.sample(10)

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2004-08-26     6005191   29.20   29.53    29.60    29.20    2161     6353347
2003-07-09     6005191   25.16   25.05    25.19    24.98    1484     3722710
2003-08-25     6005191   21.60   21.35    21.65    21.30    2345     5036822
2013-02-01     6005191  178.88  178.98   181.77   178.03   45266   813241680
2006-04-20     6005191   89.98   84.03    89.98    80.05   55615   475176336
2012-07-25     6005191  250.00  255.55   255.80   249.51   26170   664005632
2009-10-26     6005191  159.97  156.59   159.98   156.26   45644   716061312
2014-07-17     6005191  154.09  153.75   155.55   152.00   20191   309501856
2018-01-05     6005191  741.00  738.36   746.03   728.22   39989  2946493008
2012-02-09     6005191  188.00  190.75   191.15   187.66   31385   596916592

In [ ]:
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [ ]:
贵州茅台['open'].describe()

count    4094.000000
mean      182.161910
std       165.857882
min        20.900000
25%        47.405000
50%       159.930000
75%       208.500000
max       800.000000
Name: open, dtype: float64

In [ ]:
result=贵州茅台['open'].unique()

In [ ]:
result2=贵州茅台['open'].nunique()

In [ ]:
result3=贵州茅台['open'].value_counts()

In [98]:
df=pd.DataFrame({
    "name":["A","B","C","B","C","A","C"],
    "value":[1,3,7,2,4,3,1]
})
df.groupby("name")["value"].sum()

name
A     4
B     5
C    12
Name: value, dtype: int64